Revit 2015 API
ScheduleField.SetFormatOptions Method
 Sets the FormatOptions to optionally override the default settings in the Units class.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
Since: 2014
Syntax
C#
public void SetFormatOptions(
	FormatOptions formatOptions
)
Visual Basic
Public Sub SetFormatOptions ( _
	formatOptions As FormatOptions _
)
Visual C++
public:
void SetFormatOptions(
	FormatOptions^ formatOptions
)
Parameters
formatOptions
Type: Autodesk.Revit.DB.FormatOptions
 The FormatOptions.
Remarks
 See the UnitType property to determine the unit type of this field.
Examples
CopyC#
// format length units to display in feet and inches format
public void FormatLengthFields(ViewSchedule schedule)
{
    int nFields = schedule.Definition.GetFieldCount();
    for (int n = 0; n < nFields; n++)
    {
        ScheduleField field = schedule.Definition.GetField(n);
        if (field.UnitType == UnitType.UT_Length)
        {
            FormatOptions formatOpts = new FormatOptions();
            formatOpts.UseDefault = false;
            formatOpts.DisplayUnits = DisplayUnitType.DUT_FEET_FRACTIONAL_INCHES;
            field.SetFormatOptions(formatOpts);
        }
    }
}
CopyVB.NET
' format length units to display in feet and inches format
Public Sub FormatLengthFields(schedule As ViewSchedule)
    Dim nFields As Integer = schedule.Definition.GetFieldCount()
    For n As Integer = 0 To nFields - 1
        Dim field As ScheduleField = schedule.Definition.GetField(n)
        If field.UnitType = UnitType.UT_Length Then
            Dim formatOpts As New FormatOptions()
            formatOpts.UseDefault = False
            formatOpts.DisplayUnits = DisplayUnitType.DUT_FEET_FRACTIONAL_INCHES
            field.SetFormatOptions(formatOpts)
        End If
    Next
End Sub
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  The display unit in formatOptions is not a valid display unit for the unit type of this ScheduleField. See UnitUtils.IsValidDisplayUnit(UnitType, DisplayUnitType) and UnitUtils.GetValidDisplayUnits(UnitType).
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was NULL
See Also
ScheduleField Class
Autodesk.Revit.DB Namespace